# Задание 1

# num_1 = int(input("Введите первое число: "))
# num_2 = int(input("Введите второе число: "))
# for number in range(num_1, num_2 + 1):
#     if number % 7 == 0:
#         print(number)

# Задание 2
# start = int(input("Число начала диапазона: "))
# stop = int(input("Число конца диапазона: "))
# for x in range(start, stop+1):
#     print(x)

# start = int(input("Число начала диапазона: "))
# stop = int(input("Число конца диапазона: "))
# for x in range(stop,start,-1):
#     print(x)


