from gettext import find
from itertools import count

# Задание 1
# 1)
# text = "cегодня у меня дополнительное занятие. cегодня среда."
# i = text.split(". ")
# capitalized_i = [x.capitalize() for x in i]
# result = '. '.join(capitalized_i)
# print(result)

#2)
# text = "cегодня у меня 1 дополнительное занятие. cегодня среда 03 12 2025."
# i = text.split(". ")
# counter = 0
# for b in text:
#     if b.isdigit():
#         counter += 1
# print(counter)

#3)
# text = "Cегодня у меня 1 дополнительное занятие! Cегодня среда 03 12 2025!"
# counter = 0
# for b in text:
#     if b == ("!"):
#         counter += 1
# print(counter)

# Задание 2

# num = input("Введите элементы списка через пробел: ").split()
# x = input("Введите любое число: ")
# counter = 0
# for a in num:
#     if a == x:
#         counter +=1
# print(counter)

# Задание 3

# quantity = int(input("Введите количество элементов списка: "))
# x = []
# for i in range(0, quantity):
#     object = int(input("Введите элемент списка: "))
#     x.append(object)
# res = sum(x) / quantity
# print(res)



